# ParameterValuePresenceRule Properties

---
The ParameterValuePresenceRule type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule)
| Parameter|  The parameter which will be evaluated to pass this rule.
Top
#### Reference
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace